## Q1_P2:

1.Use ‘vehicle_collisions’ data set.
2.For each borough, find out distribution of each collision scale. (One car involved? Two? Three? or more?) (From 2015 to present)
3.Display a few rows of the output use df.head().
4.Generate a csv output with five columns ('borough', 'one-vehicle', 'two-vehicles', 'three-vehicles', 'more-vehicles')

In [1]:
from pandas import Series, DataFrame 
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('E:/Python/Data_Assignment_3/vehicle_collisions.csv')

In [3]:
df.head()

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
0,3146911,1/1/15,0:20,QUEENS,11358.0,40.751847,-73.787862,"(40.7518471, -73.787862)",47 AVENUE,193 STREET,...,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN,TRAFFIC CONTROL DISREGARDED,NaN,NaN,NaN,NaN
1,3146180,1/1/15,0:20,NaN,NaN,40.771289,-73.946693,"(40.7712888, -73.9466928)",NaN,NaN,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,ANIMALS ACTION,NaN,NaN,NaN,NaN
2,3146384,1/1/15,0:21,BROOKLYN,11205.0,40.689445,-73.955121,"(40.6894449, -73.9551212)",BEDFORD AVENUE,LAFAYETTE AVENUE,...,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN,FATIGUED/DROWSY,UNSPECIFIED,NaN,NaN,NaN
3,3146013,1/1/15,0:30,BROOKLYN,11213.0,40.673845,-73.925080,"(40.6738445, -73.9250801)",BUFFALO AVENUE,SAINT MARKS AVENUE,...,BUS,PASSENGER VEHICLE,NaN,NaN,NaN,LOST CONSCIOUSNESS,NaN,NaN,NaN,NaN
4,3146120,1/1/15,0:33,NaN,NaN,NaN,NaN,NaN,RICHMOND TERRACE,SOUTH AVENUE,...,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN

In [22]:
df1 = df.groupby(['BOROUGH'],sort = False)['VEHICLE 1 TYPE','VEHICLE 2 TYPE','VEHICLE 3 TYPE','VEHICLE 4 TYPE'].count().reset_index()

In [23]:
df1.head()

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE
0,QUEENS,89140,76178,5918,1420
1,BROOKLYN,104174,86799,6592,1612
2,MANHATTAN,82801,69483,2525,501
3,BRONX,45599,36972,2587,625
4,STATEN ISLAND,13943,11600,924,165

In [24]:
df2= DataFrame()

In [25]:
df2['BOROUGH'] = df1['BOROUGH']  
df2['1_Vehicle_Involved'] = df1['VEHICLE 1 TYPE'] - df1['VEHICLE 2 TYPE'] 
df2['2_Vehicles_Involved'] = df1['VEHICLE 2 TYPE'] - df1['VEHICLE 3 TYPE'] 
df2['3_Vehicles_Involved'] = df1['VEHICLE 3 TYPE'] - df1['VEHICLE 4 TYPE'] 
df2['N_Vehicles_Involved'] = df1['VEHICLE 4 TYPE'] 
df2.set_index('BOROUGH', inplace = True)

In [26]:
df2.head()

,1_Vehicle_Involved,2_Vehicles_Involved,3_Vehicles_Involved,N_Vehicles_Involved
BOROUGH,,,,
QUEENS,12962,70260,4498,1420
BROOKLYN,17375,80207,4980,1612
MANHATTAN,13318,66958,2024,501
BRONX,8627,34385,1962,625
STATEN ISLAND,2343,10676,759,165

In [27]:
df2.to_csv('Q1_P2_output.csv')